flyloong/BLE_Blance_Car/Projects/STM32F411RE-Nucleo/Examples/TIM/TIM_PWMInput/Src/my_fun.h
#ifndef __MY_FUN_H
#define __MY_FUN_H

#include "stm32f4xx_hal.h"
#include "stm32f4xx_nucleo.h"
#include "LSM9DS0_AHRS.h"
#include "iNEMO_AHRS.h"
#include "math.h"
#include "control.h"
#include "ov7725.h"
#include "com.h"
#include "cube_hal.h"

#include "osal.h"
#include "sample_service.h"
#include "role_type.h"
#include "debug.h"
#include "stm32_bluenrg_ble.h"


uint8_t fangzhen=0;//仿真的时候这里要为1，实际运行的时候为0
/////////////////////////////////////////////////
#define BDADDR_SIZE 6

BLE_RoleTypeDef BLE_Role = SERVER;
//BLE_RoleTypeDef BLE_Role = CLIENT;

extern volatile uint8_t set_connectable;
extern volatile int connected;
extern volatile uint8_t notification_enabled;

extern volatile uint8_t start_read_tx_char_handle;
extern volatile uint8_t start_read_rx_char_handle;
extern volatile uint8_t end_read_tx_char_handle;
extern volatile uint8_t end_read_rx_char_handle;



/////////////////////////////////////////////////////////
volatile float PRESSURE_Value;
volatile float HUMIDITY_Value;
volatile float TEMPERATURE_Value;
   unsigned char Speek_F[10]; 
int Turn_90_L_Flag=0;
int Lett_Right_Flag=0;
int Turn_Rest_Flag=0;
int Dance1_Flag=0;
int Dance2_Flag=0;
int Dance3_Flag=0;
int Steer_Cmd_Flag=0;
int Block_Flag=0;
int Dange_Flag=0;
int Shake_Heak_Flag=0;
int Block_Cnt=0;
int Ultrasonic_OK_Flag=0;
int Ultrasonic_May_Break=0;
int Ultrasonic_Ready_Flag=1;
int Ultrasonic_OK_Flag_Pre=0;
float GYROSCOPE_ANGLE_RATIO=0.000147f;
extern float pitch, yaw, roll;
 float yaw_Temp,yaw_Org=0;;
float pre_yaw=0.0f;
extern float g_fAngleControlOut;
extern float g_fCarAngle;
extern float  SteerConerolOut1;
extern float  SteerConerolOut2;
extern float Ult_Distance;
uint32_t Time_Start=0;
uint32_t Time_Long=0;
uint32_t Time_Long2=0;
uint32_t Time_Start_Pre=0;
int32_t Speed_L=0;
int32_t Speed_R=0;
int32_t Speed_A=0;
int Turn_Flag=0;
int Turn_Flag2=0;
int Turn_Flag1=0;
float Speed_Need=0;
float Turn_Need=0;
 float D_temp;
 float D_Err;
 float D_Integral;
int32_t Speed_A_Last=0;
uint32_t Pre_Speed_L=0;
uint32_t Pre_Speed_R=0;
uint32_t Car_Cmd=0;//自由行走避障模式
uint32_t Car_Cmd2=0;//总模式
uint32_t Car_Cmd3=0;//预警模式
uint32_t Car_Cmd4=0;//跟踪模式
char Steer_Cmd_Cnt=0;
uint32_t  Inf_Distance=0;
uint32_t  Inf_Distance_Last=0;
int Inf_Value_L[31];
int Inf_Value_R[31];
int Left_Right[2]={0,0};
static char Steer_Cmd_Array[6][30]={{79,80,81,82,83,84,85,84,83,82,81,80,79,78,77,76,75,74,73,74,75,76,77,78,79,0},//大数字向下，控制垂直方向，“是”的舵机控制码
                                      {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},//
                                      {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                                      {79,80,81,82,83,84,85,84,83,82,81,80,79,78,77,76,75,74,73,74,75,76,77,78,79,0},//大数字向左，控制水平方向，“不是”的舵机控制码
                                      {79,77,75,73,71,69,67,69,71,73,75,73,71,69,67,65,67,69,71,73,71,69,67,65,63,0},
                                      {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0}
};
UART_HandleTypeDef UartHandle6;
UART_HandleTypeDef UartHandle2;
 I2C_HandleTypeDef    I2C_EXPBD_Handle;
TIM_HandleTypeDef        TimHandleT1;//舵机
TIM_HandleTypeDef        TimHandleT2;//电机
TIM_HandleTypeDef        TimHandleT3;//编码器
TIM_HandleTypeDef        TimHandleT4;//编码器
TIM_HandleTypeDef        TimHandleT5;//定时
TIM_HandleTypeDef        TimHandleT9;//超声波
SPI_HandleTypeDef SpiHandle3;
ADC_HandleTypeDef    AdcHandle;
iNemoData s_xDataStruct;
/* Timer Input Capture Configuration Structure declaration */
TIM_IC_InitTypeDef       sConfig; 
TIM_OC_InitTypeDef       pwmConfig;//自己
TIM_Encoder_InitTypeDef  encoderConfig;
/* Slave configuration structure */
TIM_SlaveConfigTypeDef   sSlaveConfig;

volatile Axes_TypeDef ACC_Value;         /*!< Acceleration Value */
volatile Axes_TypeDef GYR_Value;         /*!< Gyroscope Value */
volatile Axes_TypeDef MAG_Value;         /*!< Magnetometer Value */

volatile AxesRaw_TypeDef ACC_Value_Raw;  
volatile AxesRaw_TypeDef GYR_Value_Raw;
volatile AxesRaw_TypeDef MAG_Value_Raw;



void Motor_Pwm_Init(void);
void Steer_Pwm_Init(void); 
void Time_Init(uint32_t ms);
void Encoder_Init(void);
void Ultrasonic_Time_Init(void);
void Camera_Init(void);
void Uart6_Init(uint32_t BaudRate);
void Uart2_Init(uint32_t BaudRate);
void Motor_Control_1(int32_t Pulse);
void Motor_Control_2(int32_t Pulse);
void Steer_Control_1(int32_t Pulse);
void Steer_Control_2(int32_t Pulse);
void Nrf24L01_GPIO_Init(void);
void Switch_GPIO_Init(void);
void AHRS_Init(void);
void AHRS_Update(void);
void Kalman_Filter(float angle_m,float gyro_m);
void Get_Speed(void);
void Adc_Init(void);
void Get_Inf_Distance(void);
void Inf_Analyze_L(void);
void Inf_Analyze_R(void);
void Steer_Control(void);
void Motor_Output(void);
void Steer_Output(void);
void Steer_Output(void);
 void Car_Turn_Deg(int *LR,int *Deg, float *Center);
 void Speech(unsigned char *buf);
 void SpeechT(unsigned char *buf1,unsigned char *buf2,unsigned char *buf3);
 void  Block_Detct(void);
 void  Dange_Detct(void);
 void Float2Char(float Value,char *array);
 void Shake_Heak(int *Shake_Heak_F);
 void Steer_Cmd_XY(int *Steer_Cmd);
 void Follow_Me(void);
 void User_Process(void);

 void BlueNRG_Init(void);
 void BlueNRG_Event(void);
 
 void BlueNRG_Event(void){
  
      if(set_connectable){
    /* Establish connection with remote device */
    Make_Connection();
    set_connectable = FALSE;
      }
      HCI_Process();
 }
 void BlueNRG_Init(void){
   
    uint8_t CLIENT_BDADDR[] = {0xbb, 0x00, 0x00, 0xE1, 0x80, 0x02};
  uint8_t SERVER_BDADDR[] = {0xaa, 0x00, 0x00, 0xE1, 0x80, 0x02};
  //uint8_t SERVER_BDADDR[] = {0xfd, 0x00, 0x25, 0xec, 0x02, 0x04}; //BT address for HRM test
  uint8_t bdaddr[BDADDR_SIZE];
  uint16_t service_handle, dev_name_char_handle, appearance_char_handle;
  int ret;
   
     /* Initialize the BlueNRG SPI driver */
  BNRG_SPI_Init();

  /* Initialize the BlueNRG HCI */
  HCI_Init();

  /* Reset BlueNRG hardware */
  BlueNRG_RST();
  
  if(BLE_Role == CLIENT) {
    Osal_MemCpy(bdaddr, CLIENT_BDADDR, sizeof(CLIENT_BDADDR));
  } else {
    Osal_MemCpy(bdaddr, SERVER_BDADDR, sizeof(SERVER_BDADDR));
  }
  
  ret = aci_hal_write_config_data(CONFIG_DATA_PUBADDR_OFFSET,
                                  CONFIG_DATA_PUBADDR_LEN,
                                  bdaddr);
  if(ret){
    PRINTF("Setting BD_ADDR failed.\n");
  }
  
  ret = aci_gatt_init();    
  if(ret){
    PRINTF("GATT_Init failed.\n");
  }
  
  if(BLE_Role == SERVER) {
#ifdef BLUENRG_MS
    ret = aci_gap_init(GAP_PERIPHERAL_ROLE, 0, 0x07, &service_handle, &dev_name_char_handle, &appearance_char_handle);
#else
    ret = aci_gap_init(GAP_PERIPHERAL_ROLE, &service_handle, &dev_name_char_handle, &appearance_char_handle);
#endif
  } else {
#ifdef BLUENRG_MS
    ret = aci_gap_init(GAP_CENTRAL_ROLE, 0, 0x07, &service_handle, &dev_name_char_handle, &appearance_char_handle);
#else
    ret = aci_gap_init(GAP_CENTRAL_ROLE, &service_handle, &dev_name_char_handle, &appearance_char_handle);
#endif
  }
  
  if(ret != BLE_STATUS_SUCCESS){
    PRINTF("GAP_Init failed.\n");
  }
    
