flyloong/BLE_Blance_Car/Projects/STM32F411RE-Nucleo/Examples/TIM/TIM_PWMInput/Src/my_fun.h
  ret = aci_gap_set_auth_requirement(MITM_PROTECTION_REQUIRED,
                                     OOB_AUTH_DATA_ABSENT,
                                     NULL,
                                     7,
                                     16,
                                     USE_FIXED_PIN_FOR_PAIRING,
                                     123456,
                                     BONDING);
  if (ret == BLE_STATUS_SUCCESS) {
    PRINTF("BLE Stack Initialized.\n");
  }
  
  if(BLE_Role == SERVER) {
    PRINTF("SERVER: BLE Stack Initialized\n");
    ret = Add_Sample_Service();
    
    if(ret == BLE_STATUS_SUCCESS)
      PRINTF("Service added successfully.\n");
    else
      PRINTF("Error while adding service.\n");
    
  } else {
    PRINTF("CLIENT: BLE Stack Initialized\n");
  }
    aci_hal_set_tx_power_level(1,7);//信号强度
   
 }
 
 
 void Follow_Me(void){
     
      
   if(Ultrasonic_OK_Flag==0){
    if(Inf_Distance>1600)
      D_temp=44554.0/Inf_Distance+Inf_Distance/1400.0-9.0;
    else if  (Inf_Distance<=1600&&Inf_Distance>800)
          D_temp=133333.3/Inf_Distance+Inf_Distance/15.0-170;
    else if (Inf_Distance<=800)
         D_temp=50;   
   }
   else {
     if(Ult_Distance<500)
     D_temp=Ult_Distance/10;
     else D_temp=50;
   }
   
   D_Err=25-D_temp;
   D_Integral+=D_Err;
   if(D_Integral>5000)D_Integral=5000;
    if(D_Integral<-5000)D_Integral=-5000;
   //xianfu
    if(D_temp>5&&D_temp<50){
      Speed_Need=D_Err*60+D_Integral*0.3;
 if(Speed_Need<-2000)Speed_Need=-2000;
    }
    else{
      Speed_Need=0;
     D_Integral=0;
      
      
    }
 }
 void  Dange_Detct(void){
  
 
   if(Ultrasonic_OK_Flag==0){
   
     if(Inf_Distance>1000&&Dange_Flag==0&&Speed_Need<0){
         Dange_Flag=1;
          Speech("[m55]危险");  
     }
       else if(Inf_Distance<700&&Dange_Flag){
         Dange_Flag++;
        
         if(Dange_Flag>50){
           Dange_Flag=0;
           Speech("[m55]安全");  
         }      
     }
     else if(Inf_Distance>=700&&Dange_Flag)
       Dange_Flag=1;   
     if(Dange_Flag&&Speed_Need<0)Speed_Need=0;  
  }
   else{
      if(Ult_Distance<300&&Dange_Flag==0&&Speed_Need<0){
         Dange_Flag=1;
          Speech("[m55]危险");  
     }
       else if(Ult_Distance>500&&Dange_Flag){
         Dange_Flag++;
        
         if(Dange_Flag>50){
           Dange_Flag=0;
           Speech("[m55]安全");  
         }      
     }
     else if(Ult_Distance<=500&&Dange_Flag)
       Dange_Flag=1;   
     if(Dange_Flag&&Speed_Need<0)Speed_Need=0;  

   }
   
 }
     
   
 

 void Steer_Cmd_XY(int *SteerCmd){

   if(*SteerCmd){
     if(Steer_Cmd_Array[*SteerCmd][Steer_Cmd_Cnt])
     SteerConerolOut2=Steer_Cmd_Array[*SteerCmd][Steer_Cmd_Cnt];
     if (Steer_Cmd_Array[*SteerCmd-1][Steer_Cmd_Cnt])
        SteerConerolOut1=Steer_Cmd_Array[*SteerCmd-1][Steer_Cmd_Cnt];
     if(Steer_Cmd_Array[*SteerCmd][Steer_Cmd_Cnt]==0&&Steer_Cmd_Array[*SteerCmd-1][Steer_Cmd_Cnt]==0){
       *SteerCmd=0;
       Steer_Cmd_Cnt=0;
     }
     Steer_Cmd_Cnt++;
    
   }
 }
void Shake_Heak(int *Shake_Heak_F){
  
 if(*Shake_Heak_F==1){
   
   if(SteerConerolOut2>59&&Turn_Flag2==0){//从左至右
     SteerConerolOut2--;
   }
     else if(SteerConerolOut2<99&&Turn_Flag2==1){//从右至左
       SteerConerolOut2++;
     }
   else if(SteerConerolOut2==99){
    Turn_Flag2=0;
  }
  else if(SteerConerolOut2==59){    
      Turn_Flag2=1;
  }
  
  if(SteerConerolOut1<99&&Turn_Flag1==0){
    SteerConerolOut1++;
  }
  else if(SteerConerolOut1>59&&Turn_Flag1==1){
    SteerConerolOut1--;
  }
  else if(SteerConerolOut1==99){
    Turn_Flag1=1;
  }
  else if(SteerConerolOut1==59){    
      Turn_Flag1=0;
  }
 }
}
 
 
 void  Block_Detct(void){
  
   if(Speed_L<80&&Speed_L>-80&&Speed_R<80&&Speed_R>-80&&g_fAngleControlOut<100){
     Block_Cnt++;  
   }
   else if (Block_Cnt){
     Block_Cnt=0;
     
     
   }
   if(Block_Cnt>7){
     Block_Flag=1;
     Block_Cnt=0;
   }
   if(Block_Flag){
     Speed_Need=1000;
      Turn_Need=100;
     Block_Flag++;
     if(Block_Flag>20){
       Block_Flag=0;
       ////////左转
    //    Turn_90_L_Flag=90;
   //   Lett_Right_Flag=1;
    //      yaw_Temp=yaw;
     }
     
     
   }
   
   
 }
 
  void Speech(unsigned char *buf)
{ 
    unsigned char len = 0x00;
    unsigned char head[5] = {0xfd,0x00,0x00,0x01,0x00};
    while(buf[len++]!= 0);
head[2]=len+2;
HAL_UART_Transmit(&UartHandle6,head,5,100);
HAL_UART_Transmit(&UartHandle6,buf,len,100);
  
}

  void SpeechT(unsigned char *buf1,unsigned char *buf2,unsigned char *buf3)
{ 
    unsigned char len1 = 0x00;
     unsigned char len2 = 0x00;
      unsigned char len3 = 0x00;
    unsigned char head[5] = {0xfd,0x00,0x00,0x01,0x00};
    while(buf1[len1++]!= 0);
    while(buf2[len2++]!= '\0');
    while(buf3[len3++]!= 0);
head[2]+=len1;
head[2]+=len2;
head[2]+=len3;
head[2]+=0;
HAL_UART_Transmit(&UartHandle6,head,5,100);
HAL_UART_Transmit(&UartHandle6,buf1,len1-1,100);
HAL_UART_Transmit(&UartHandle6,buf2,len2-1,100);
HAL_UART_Transmit(&UartHandle6,buf3,len3,100);

  
}

/*
void Car_Turn_Deg(int *Deg){
  if(*Deg){
   if(yaw-pre_yaw<-300){
        yaw_Temp-=360;
      }
      else if(yaw-pre_yaw>300){
        yaw_Temp +=360;
      }  
   if(*Deg>0){
      Turn_Need=-400;
       if(yaw-yaw_Temp>*Deg) *Deg=0;
       
    }
   else {
      Turn_Need=400;
      if(yaw-yaw_Temp<*Deg) *Deg=0;
   }
       
       if(Dance1_Flag){
       SteerConerolOut2 =79-(yaw-yaw_Temp)/2;
      }
  }
   pre_yaw=yaw;
}
*/
/*
 void Car_Turn_Deg(int *LR,int *Deg, float *Center){
  if(*LR){
   if(yaw-pre_yaw<-300){
        *Center-=360;
      }
      else if(yaw-pre_yaw>300){
        *Center +=360;
      }  
   if(*LR==1){
      Turn_Need=-400;
      if(yaw-*Center>*Deg) {
         *Deg=0;
         *LR=0;
         
      }
    }
   else if(*LR==2){
      Turn_Need=400;
      if(yaw-*Center<*Deg){
        *Deg=0;
        *LR=0;
      }
   }
       
       if(Dance1_Flag){
       SteerConerolOut2 =79-(yaw-*Center)/2;
     //  SteerConerolOut1 =79-(yaw-*Center)/3;
      }
  }
   pre_yaw=yaw;
}  
  */
   void Car_Turn_Deg(int *LR,int *Deg, float *Center){
  if(*LR){
    
   if(yaw-pre_yaw<-300){
    //    Temp_Center=*Center-360;
     *Center-=360;
      }
      else if(yaw-pre_yaw>300){
      //  Temp_Center=*Center+360;
         *Center+=360;
      }  
 //  else Temp_Center=*Center;
   
   if(*LR==1){
      Turn_Need=-400;
      if(yaw-*Center>*Deg) {
         *Deg=0;
         *LR=0;
          
         
