flyloong/BLE_Blance_Car/Projects/STM32F411RE-Nucleo/Examples/TIM/TIM_PWMInput/Src/my_fun.h
      }
    }
   else if(*LR==2){
      Turn_Need=400;
      if(yaw-*Center<*Deg){
        *Deg=0;
        *LR=0;
       
      }
   }
       
       if(Dance1_Flag){
       SteerConerolOut2 =73-(yaw-*Center)/2;
     //  SteerConerolOut1 =79-(yaw-*Center)/3;
      }
  }
   pre_yaw=yaw;
}

void Steer_Output(void){
  
  int Temp_SteerConerolOut1,Temp_SteerConerolOut2;
  Temp_SteerConerolOut1=(int)SteerConerolOut1;
  Temp_SteerConerolOut2=(int)SteerConerolOut2;
  if(Temp_SteerConerolOut2>130)Temp_SteerConerolOut2=130;
  if(Temp_SteerConerolOut2<34)Temp_SteerConerolOut2=34;
  if(Temp_SteerConerolOut1>130)Temp_SteerConerolOut1=130;
  if(Temp_SteerConerolOut1<34)Temp_SteerConerolOut1=34;
  
  
  Steer_Control_2(Temp_SteerConerolOut2);
Steer_Control_1(Temp_SteerConerolOut1);
}
  
void Steer_Control(void){
  
  if(SteerConerolOut2<100&&Turn_Flag==1){//从右至左
  Inf_Value_L[100-(int)SteerConerolOut2]=Inf_Distance;
 SteerConerolOut2++;
  }
  else if(SteerConerolOut2>70&&Turn_Flag==0){//从左至右
  Inf_Value_R[(int)SteerConerolOut2-70]=Inf_Distance;
  SteerConerolOut2--;
  }
  else if(SteerConerolOut2==100){
     Inf_Value_L[0]=Inf_Distance;
    Turn_Flag=0;
  Inf_Analyze_L();//从右到左，分析右边的数据
  }
  else if(SteerConerolOut2==70){
     Inf_Value_R[0]=Inf_Distance;
      Turn_Flag=1;
   Inf_Analyze_R();//从左到右
  }

  
}

void Inf_Analyze_L(void){
  int i;
  for(i=10;i<=30;i++){
    if(Inf_Value_L[i]>1000){
      Left_Right[0]=i;
    break;
  }
    if (i==30)
    Left_Right[0]=-1;
  }
  if(Car_Cmd&0x01)
 Turn_Control();
}
void Inf_Analyze_R(void){
  int i;
  for(i=10;i<=30;i++){
    if(Inf_Value_R[i]>1000){
      Left_Right[1]=i;
    break;
  }
    if (i==30)
    Left_Right[1]=-1;
  }
  if(Car_Cmd&0x01)
 Turn_Control();
}

void Get_Inf_Distance(void){
  
  //  HAL_ADC_PollForConversion(&AdcHandle,100);
 Inf_Distance_Last=HAL_ADC_GetValue(&AdcHandle);
 Inf_Distance*=0.5;
 Inf_Distance+=0.5*Inf_Distance_Last;
  
}
void Adc_Init(){
  ADC_ChannelConfTypeDef sConfig;
   GPIO_InitTypeDef          GPIO_InitStruct;
   __HAL_RCC_GPIOB_CLK_ENABLE();
   __HAL_RCC_ADC1_CLK_ENABLE();
    GPIO_InitStruct.Pin = GPIO_PIN_1;
  GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
  
  AdcHandle.Instance = ADC1;
  
  AdcHandle.Init.ClockPrescaler = ADC_CLOCKPRESCALER_PCLK_DIV2;
  AdcHandle.Init.Resolution = ADC_RESOLUTION_12B;
  AdcHandle.Init.ScanConvMode = DISABLE;
  AdcHandle.Init.ContinuousConvMode = ENABLE;
  AdcHandle.Init.DiscontinuousConvMode = DISABLE;
  AdcHandle.Init.NbrOfDiscConversion = 0;
  AdcHandle.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
  AdcHandle.Init.ExternalTrigConv = ADC_EXTERNALTRIGCONV_T1_CC1;
  AdcHandle.Init.DataAlign = ADC_DATAALIGN_RIGHT;
  AdcHandle.Init.NbrOfConversion = 1;
  AdcHandle.Init.DMAContinuousRequests = DISABLE;
  AdcHandle.Init.EOCSelection = DISABLE;
  
  HAL_ADC_Init(&AdcHandle);
  sConfig.Channel = ADC_CHANNEL_9;
  sConfig.Rank = 1;
  sConfig.SamplingTime = ADC_SAMPLETIME_3CYCLES;
  sConfig.Offset = 0;
  HAL_ADC_ConfigChannel(&AdcHandle, &sConfig);
  HAL_ADC_Start(&AdcHandle);
}
void Get_Speed(void){
  uint32_t TempL,TempR;
    TempL=HAL_TIM_ReadCapturedValue(&TimHandleT3, TIM_CHANNEL_1);//编码器读取
  //  if(TempL-Pre_Speed_L>30000){
  //    Speed_L=TempL-Pre_Speed_L-65535;}
  //  else if  (TempL-Pre_Speed_L<-30000){
  //    Speed_L=TempL-Pre_Speed_L+65535;  }
  //  else 
      Speed_L=TempL-Pre_Speed_L;
     Pre_Speed_L=TempL;  
     if(Speed_L<-20000){
        Speed_L+=65535;}
        else   if(Speed_L>20000){
        Speed_L-=65535;} 
    TempR=HAL_TIM_ReadCapturedValue(&TimHandleT4, TIM_CHANNEL_1);//编码器读取
  //  if(TempR-Pre_Speed_R>30000){
  //    Speed_R=TempR-Pre_Speed_R-65535;}
  //  else if  (TempR-Pre_Speed_R<-30000){
   //   Speed_R=TempR-Pre_Speed_R+65535;  }
  //  else
       Speed_R=TempR-Pre_Speed_R;
 Pre_Speed_R=TempR;  
       if(Speed_R<-20000){
        Speed_R+=65535;}
          else   if(Speed_R>20000){
        Speed_R-=65535;} 
   //   Speed_A=(Speed_L-Speed_R)/2;
        Speed_A_Last=(Speed_L-Speed_R)/2;
  Speed_A*=0.7;
    Speed_A+=Speed_A_Last*0.3;  
      
 
}
float ax_pre=0;

void AHRS_Update(void){
  float ax,ay,az,gx,gy,gz,mx,my,mz;
  
  
  
    BSP_IMU_6AXES_X_GetAxesRaw((AxesRaw_TypeDef *)&ACC_Value_Raw);
    BSP_IMU_6AXES_G_GetAxesRaw((AxesRaw_TypeDef *)&GYR_Value_Raw);
    BSP_MAGNETO_M_GetAxesRaw((AxesRaw_TypeDef *)&MAG_Value_Raw);
   
    ax=ACC_Value_Raw.AXIS_X;
   // ax=0.9*ax_pre+0.1*ax;
    ax_pre=ax;
    ay=ACC_Value_Raw.AXIS_Y;
    az=ACC_Value_Raw.AXIS_Z;
    gx=(GYR_Value_Raw.AXIS_X+162)*GYROSCOPE_ANGLE_RATIO;
    gy=(GYR_Value_Raw.AXIS_Y-50) *GYROSCOPE_ANGLE_RATIO;
    gz=(GYR_Value_Raw.AXIS_Z-455)*GYROSCOPE_ANGLE_RATIO;
  //   gx=(GYR_Value_Raw.AXIS_X+162)*0.00015f;
  //  gy=(GYR_Value_Raw.AXIS_Y-50) *0.00015f;
  //  gz=(GYR_Value_Raw.AXIS_Z-455)*0.00015f;
    mx=MAG_Value_Raw.AXIS_X+6000;
    my=MAG_Value_Raw.AXIS_Y+5800;
    mz=MAG_Value_Raw.AXIS_Z+1200;
    
    
    
  //  mahonyQuaternionUpdate( ax,  ay,  az,  gx,  gy,  gz,  mx,  my,  mz);
 //   madgwickQuaternionUpdate( ax,  ay,  az,  gx,  gy,  gz,  mx,  my,  mz);
  //   MahonyAHRSupdate( gx,  gy,  gz,ax,  ay,  az,    mx,  my,  mz);
MahonyAHRSupdateIMU( gx,  gy,  gz,ax,  ay,  az);
    LSM9DS0_AHRS_updateEulerAngles();
  //  Kalman_Filter(ax/182 ,-(GYR_Value_Raw.AXIS_Y-50)*0.01);
    SpeedControlOutput();
        AngleControl();
        Motor_Output();
       
    /*
   s_xDataStruct.xSensorData.m_fAcc[0]=ACC_Value_Raw.AXIS_X*9.81f/100.0f;
   s_xDataStruct.xSensorData.m_fAcc[1]=-ACC_Value_Raw.AXIS_Y*9.81f/100.0f;
   s_xDataStruct.xSensorData.m_fAcc[2]=-ACC_Value_Raw.AXIS_Z*9.81f/100.0f;
   s_xDataStruct.xSensorData.m_fGyro[0]=GYR_Value_Raw.AXIS_X/14.258*3.141592f/180.0f/10000;
   s_xDataStruct.xSensorData.m_fGyro[1]=-GYR_Value_Raw.AXIS_Y/14.258*3.141592f/180.0/10000;
   s_xDataStruct.xSensorData.m_fGyro[2]=-GYR_Value_Raw.AXIS_Z/14.258*3.141592f/180.0/10000;
   s_xDataStruct.xSensorData.m_fMag[0]=MAG_Value_Raw.AXIS_X/450;
   s_xDataStruct.xSensorData.m_fMag[1]=-MAG_Value_Raw.AXIS_Y/450;
   s_xDataStruct.xSensorData.m_fMag[2]=-MAG_Value_Raw.AXIS_Z/400;
    */
    /*
   s_xDataStruct.xSensorData.m_fAcc[0]=ACC_Value_Raw.AXIS_X*2.0/32768.0;
   s_xDataStruct.xSensorData.m_fAcc[1]=-ACC_Value_Raw.AXIS_Y*2.0/32768.0;
   s_xDataStruct.xSensorData.m_fAcc[2]=-ACC_Value_Raw.AXIS_Z*2.0/32768.0;
   s_xDataStruct.xSensorData.m_fGyro[0]=GYR_Value_Raw.AXIS_X*2000.0/32768.0* 3.1416 / 180.0;
   s_xDataStruct.xSensorData.m_fGyro[1]=-GYR_Value_Raw.AXIS_Y*2000.0/32768.0* 3.1416 / 180.0;
   s_xDataStruct.xSensorData.m_fGyro[2]=-GYR_Value_Raw.AXIS_Z*2000.0/32768.0* 3.1416 / 180.0;
   s_xDataStruct.xSensorData.m_fMag[0]=MAG_Value_Raw.AXIS_X*4.0/32768.0;
   s_xDataStruct.xSensorData.m_fMag[1]=-MAG_Value_Raw.AXIS_Y*4.0/32768.0;
   s_xDataStruct.xSensorData.m_fMag[2]=-MAG_Value_Raw.AXIS_Z*4.0/32768.0;
   */
    /*
  iNEMO_AHRS_Update(&(s_xDataStruct.xSensorData), &(s_xDataStruct.xEulerAngles), &(s_xDataStruct.xQuat));
  roll  = s_xDataStruct.xEulerAngles.m_fRoll* 180.0f / 3.141592f;
  pitch = s_xDataStruct.xEulerAngles.m_fPitch * 180.0f / 3.141592f;
  yaw  = s_xDataStruct.xEulerAngles.m_fYaw * 180.0f / 3.141592f;
   */
  
