flyloong/BLE_Blance_Car/Projects/STM32F411RE-Nucleo/Examples/TIM/TIM_PWMInput/Src/my_fun.h
}
void Motor_Output(void){
  int temp1,temp2;
  temp1=(int)(g_fAngleControlOut+Turn_Need)*1.035;
  if(temp1>1000)temp1=1000;
  if(temp1<-1000)temp1=-1000;
    temp2=(int)(g_fAngleControlOut-Turn_Need);
  if(temp2>1000)temp2=1000;
  if(temp2<-1000)temp2=-1000;
   if(g_fCarAngle>-50&&g_fCarAngle<50){  
    Motor_Control_1(temp1 );
     Motor_Control_2(temp2);
        }
        else{
        Motor_Control_1(0);
     Motor_Control_2(0);    
        }
}
  void AHRS_Init(void){
    s_xDataStruct.xSensorData.m_fAccRef[0]=0;
      s_xDataStruct.xSensorData.m_fAccRef[1]=0;
      s_xDataStruct.xSensorData.m_fAccRef[2]=-9.81f;
      
      s_xDataStruct.xSensorData.m_fMagRef[0]=0.37f;
      s_xDataStruct.xSensorData.m_fMagRef[1]=0;
      s_xDataStruct.xSensorData.m_fMagRef[2]=-0.25f;
      
      
     
    //  if(s_uTimerFrequence<7)
    //    s_xDataStruct.xSensorData.m_fDeltaTime=1.0f/nFreqEnum2freVal[s_uTimerFrequence];
    //  else
        s_xDataStruct.xSensorData.m_fDeltaTime=0.002f;
      
      s_xDataStruct.xSensorData.m_fVarAcc=5.346e-6;
      s_xDataStruct.xSensorData.m_fVarMag=5.346e-6;//这里我将源程序的5.346e-6缩小了10倍

      iNEMO_AHRS_Init(&s_xDataStruct.xSensorData, &s_xDataStruct.xEulerAngles, &s_xDataStruct.xQuat);
    
  }
  void Switch_GPIO_Init(void){
  GPIO_InitTypeDef  GPIO_InitStruct;
  __HAL_RCC_GPIOD_CLK_ENABLE(); 
       GPIO_InitStruct.Mode    = GPIO_MODE_INPUT;
      GPIO_InitStruct.Pull      = GPIO_PULLUP;
   GPIO_InitStruct.Pin     =GPIO_PIN_2;
    HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);
  }

void Nrf24L01_GPIO_Init(void){
    GPIO_InitTypeDef  GPIO_InitStruct;
  __HAL_RCC_GPIOC_CLK_ENABLE(); 
     GPIO_InitStruct.Mode    = GPIO_MODE_OUTPUT_PP;
      GPIO_InitStruct.Pull      = GPIO_NOPULL;
      GPIO_InitStruct.Speed     = GPIO_SPEED_FAST;
  GPIO_InitStruct.Pin     =GPIO_PIN_8|GPIO_PIN_9|GPIO_PIN_10|GPIO_PIN_11;
 HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
       GPIO_InitStruct.Mode    = GPIO_MODE_INPUT;
      GPIO_InitStruct.Pull      = GPIO_NOPULL;
   GPIO_InitStruct.Pin     =GPIO_PIN_12;
    HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
/*
__HAL_RCC_SPI3_CLK_ENABLE();
  GPIO_InitStruct.Pin       = GPIO_PIN_10|GPIO_PIN_11|GPIO_PIN_12;
  GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull      = GPIO_PULLUP;
  GPIO_InitStruct.Speed     = GPIO_SPEED_FAST;
  GPIO_InitStruct.Alternate = GPIO_AF6_SPI3;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  SpiHandle3.Instance               = SPI3;
  SpiHandle3.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_256;
  SpiHandle3.Init.Direction         = SPI_DIRECTION_2LINES;
  SpiHandle3.Init.CLKPhase          = SPI_PHASE_2EDGE;
  SpiHandle3.Init.CLKPolarity       = SPI_POLARITY_HIGH;
  SpiHandle3.Init.CRCCalculation    = SPI_CRCCALCULATION_DISABLE;
  SpiHandle3.Init.CRCPolynomial     = 7;
  SpiHandle3.Init.DataSize          = SPI_DATASIZE_8BIT;
  SpiHandle3.Init.FirstBit          = SPI_FIRSTBIT_MSB;
  SpiHandle3.Init.NSS               = SPI_NSS_SOFT;
  SpiHandle3.Init.TIMode            = SPI_TIMODE_DISABLE;
  SpiHandle3.Init.Mode              = SPI_MODE_MASTER;

  HAL_SPI_Init(&SpiHandle3);
 */
}
  void Steer_Control_1(int32_t Pulse){
    
    
    
    HAL_TIM_PWM_Pulse(&TimHandleT1,TIM_CHANNEL_3,Pulse);
  }
  void Steer_Control_2(int32_t Pulse){
     HAL_TIM_PWM_Pulse(&TimHandleT1,TIM_CHANNEL_2,Pulse);
  }

void Motor_Control_1(int32_t Pulse){
  if(Pulse==0){
    GPIOB->BSRR =GPIO_PIN_2<<16;	
    GPIOB->BSRR =GPIO_PIN_12<<16;
  }
  else if(Pulse>0){
    GPIOB->BSRR =GPIO_PIN_2;	
    GPIOB->BSRR =GPIO_PIN_12<<16;
    HAL_TIM_PWM_Pulse(&TimHandleT2,TIM_CHANNEL_3,Pulse);
  }
  else{
        GPIOB->BSRR =GPIO_PIN_2<<16;	
    GPIOB->BSRR =GPIO_PIN_12;
    HAL_TIM_PWM_Pulse(&TimHandleT2,TIM_CHANNEL_3,-Pulse);
  }
}
void Motor_Control_2(int32_t Pulse){
    if(Pulse==0){
    GPIOA->BSRR =GPIO_PIN_13<<16;	
    GPIOA->BSRR =GPIO_PIN_14<<16;
    }
   else if(Pulse>0){
    GPIOA->BSRR =GPIO_PIN_13;	
    GPIOA->BSRR =GPIO_PIN_14<<16;
    HAL_TIM_PWM_Pulse(&TimHandleT2,TIM_CHANNEL_1,Pulse);
  }
  else{
    GPIOA->BSRR =GPIO_PIN_13<<16;	
    GPIOA->BSRR =GPIO_PIN_14;
    HAL_TIM_PWM_Pulse(&TimHandleT2,TIM_CHANNEL_1,-Pulse);
  }
  
  
}
void Uart6_Init(uint32_t BaudRate){
UartHandle6.Instance          = USART6;
  UartHandle6.Init.BaudRate     = BaudRate;
  UartHandle6.Init.WordLength   = UART_WORDLENGTH_8B;
  UartHandle6.Init.StopBits     = UART_STOPBITS_1;
  UartHandle6.Init.Parity       = UART_PARITY_NONE;
  UartHandle6.Init.HwFlowCtl    = UART_HWCONTROL_NONE;
  UartHandle6.Init.Mode         = UART_MODE_TX;
  UartHandle6.Init.OverSampling = UART_OVERSAMPLING_16;
  
  GPIO_InitTypeDef  GPIO_InitStruct;
__HAL_RCC_GPIOA_CLK_ENABLE();
__HAL_RCC_USART6_CLK_ENABLE();
  GPIO_InitStruct.Pin       = GPIO_PIN_11;
  GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
 // GPIO_InitStruct.Pull      = GPIO_PULLUP;
   GPIO_InitStruct.Pull      =GPIO_NOPULL;
  GPIO_InitStruct.Speed     = GPIO_SPEED_FAST;
  GPIO_InitStruct.Alternate = GPIO_AF8_USART6;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
  //GPIO_InitStruct.Pin = GPIO_PIN_12;
  //GPIO_InitStruct.Alternate = GPIO_AF8_USART6;
  //HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
   HAL_UART_Init(&UartHandle6); 

}
void Uart2_Init(uint32_t BaudRate){
UartHandle2.Instance          = USART2;
  UartHandle2.Init.BaudRate     = BaudRate;
  UartHandle2.Init.WordLength   = UART_WORDLENGTH_8B;
  UartHandle2.Init.StopBits     = UART_STOPBITS_1;
  UartHandle2.Init.Parity       = UART_PARITY_NONE;
  UartHandle2.Init.HwFlowCtl    = UART_HWCONTROL_NONE;
  UartHandle2.Init.Mode         = UART_MODE_TX_RX;
  UartHandle2.Init.OverSampling = UART_OVERSAMPLING_16;
  
  GPIO_InitTypeDef  GPIO_InitStruct;
  __HAL_RCC_GPIOA_CLK_ENABLE();
__HAL_RCC_USART2_CLK_ENABLE(); 
  GPIO_InitStruct.Pin       = GPIO_PIN_2;
  GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull      = GPIO_PULLUP;
  GPIO_InitStruct.Speed     = GPIO_SPEED_FAST;
  GPIO_InitStruct.Alternate = GPIO_AF7_USART2;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
  GPIO_InitStruct.Pin       = GPIO_PIN_3;
  GPIO_InitStruct.Alternate = GPIO_AF7_USART2;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
   HAL_UART_Init(&UartHandle2); 

