flyloong/BLE_Blance_Car/Projects/STM32F411RE-Nucleo/Examples/TIM/TIM_PWMInput/Src/my_fun.h
}
 // printf("\n\r UART Printf Example: retarget the C library printf function to the UART\n\r");

void Encoder_Init(void){
TimHandleT3.Instance = TIM3;
  TimHandleT3.Init.Period =  0xFFFF;
  TimHandleT3.Init.Prescaler = 0;
  TimHandleT3.Init.ClockDivision = 0;
  TimHandleT3.Init.CounterMode = TIM_COUNTERMODE_UP;  
  
  encoderConfig.EncoderMode =TIM_ENCODERMODE_TI1;
  encoderConfig.IC1Polarity =TIM_ICPOLARITY_RISING;
  encoderConfig.IC1Selection=TIM_ICSELECTION_DIRECTTI;
  encoderConfig.IC1Prescaler=0;
  encoderConfig.IC1Filter   =6;
  encoderConfig.IC2Polarity =TIM_ICPOLARITY_RISING;
  encoderConfig.IC2Selection=TIM_ICSELECTION_DIRECTTI;
  encoderConfig.IC2Prescaler=0;
  encoderConfig.IC2Filter   =6;
HAL_TIM_Encoder_Init(&TimHandleT3,  &encoderConfig);
HAL_TIM_Encoder_Start(&TimHandleT3,TIM_CHANNEL_1);

  TimHandleT4.Instance = TIM4;
  TimHandleT4.Init.Period =  0xFFFF;
  TimHandleT4.Init.Prescaler = 0;
  TimHandleT4.Init.ClockDivision = 0;
  TimHandleT4.Init.CounterMode = TIM_COUNTERMODE_UP;  
HAL_TIM_Encoder_Init(&TimHandleT4,  &encoderConfig);
HAL_TIM_Encoder_Start(&TimHandleT4,TIM_CHANNEL_1);

}

void Motor_Pwm_Init(void){
   
  
  TimHandleT2.Instance = TIM2;
  TimHandleT2.Init.Period =  1000 - 1;;
  TimHandleT2.Init.Prescaler = 20-1;
  TimHandleT2.Init.ClockDivision = 0;
  TimHandleT2.Init.CounterMode = TIM_COUNTERMODE_UP;  
  HAL_TIM_PWM_Init(&TimHandleT2);

  pwmConfig.OCMode=TIM_OCMODE_PWM1;
  pwmConfig.Pulse=700;
  HAL_TIM_PWM_ConfigChannel(&TimHandleT2, &pwmConfig, TIM_CHANNEL_3);
   HAL_TIM_PWM_ConfigChannel(&TimHandleT2, &pwmConfig, TIM_CHANNEL_1);
  HAL_TIM_PWM_Start(&TimHandleT2, TIM_CHANNEL_3);
  HAL_TIM_PWM_Start(&TimHandleT2, TIM_CHANNEL_1);
  
  
  //电机控制引脚
     __HAL_RCC_GPIOA_CLK_ENABLE();
   GPIO_InitTypeDef GPIO_InitStruct;
     GPIO_InitStruct.Mode    = GPIO_MODE_OUTPUT_PP;
      GPIO_InitStruct.Pull      = GPIO_NOPULL;
      GPIO_InitStruct.Speed     = GPIO_SPEED_FAST;

  GPIO_InitStruct.Pin     =GPIO_PIN_13|GPIO_PIN_14;
if(fangzhen==0)
 HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

   GPIO_InitStruct.Pin     =GPIO_PIN_2|GPIO_PIN_12;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
  
  }

void Steer_Pwm_Init(void){
  
    GPIO_InitTypeDef GPIO_InitStruct;
  
    __HAL_RCC_GPIOA_CLK_ENABLE();
     __HAL_RCC_TIM1_CLK_ENABLE();
  GPIO_InitStruct.Pin = GPIO_PIN_10|GPIO_PIN_9;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF1_TIM1;

     HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
  
  TimHandleT1.Instance = TIM1;
  TimHandleT1.Init.Period =  1000 - 1;;
  TimHandleT1.Init.Prescaler = 2000-1;
  TimHandleT1.Init.ClockDivision = 0;
  TimHandleT1.Init.CounterMode = TIM_COUNTERMODE_UP;  
  HAL_TIM_PWM_Init(&TimHandleT1);

  pwmConfig.OCMode=TIM_OCMODE_PWM1;
  pwmConfig.Pulse=79;
  HAL_TIM_PWM_ConfigChannel(&TimHandleT1, &pwmConfig, TIM_CHANNEL_2);
   HAL_TIM_PWM_ConfigChannel(&TimHandleT1, &pwmConfig, TIM_CHANNEL_3);
  HAL_TIM_PWM_Start(&TimHandleT1, TIM_CHANNEL_3);
  HAL_TIM_PWM_Start(&TimHandleT1, TIM_CHANNEL_2);
  
  

     __HAL_RCC_GPIOA_CLK_ENABLE();
      __HAL_RCC_TIM1_CLK_ENABLE();
  
  
  }
void Time_Init(uint32_t ms){
  TimHandleT5.Instance = TIM5;
  TimHandleT5.Init.Period = ms - 1;
  TimHandleT5.Init.Prescaler = 10000-1;
  TimHandleT5.Init.ClockDivision = 0;
  TimHandleT5.Init.CounterMode = TIM_COUNTERMODE_UP;
 
    __HAL_RCC_TIM5_CLK_ENABLE();
  HAL_NVIC_SetPriority(TIM5_IRQn, 4, 0);
  HAL_NVIC_EnableIRQ(TIM5_IRQn);
  HAL_TIM_Base_Init(&TimHandleT5);
  HAL_TIM_Base_Start_IT(&TimHandleT5);
}
void Ultrasonic_Time_Init(void){
  TimHandleT9.Instance = TIM9;
  TimHandleT9.Init.Period = 0xFFFF;
  TimHandleT9.Init.Prescaler = 640;
  TimHandleT9.Init.ClockDivision = 0;
  TimHandleT9.Init.CounterMode = TIM_COUNTERMODE_UP;

  __HAL_RCC_TIM9_CLK_ENABLE();
  
  
  HAL_TIM_Base_Init(&TimHandleT9);
  HAL_TIM_Base_Start(&TimHandleT9);
  /*
   GPIO_InitTypeDef   GPIO_InitStructure;
  __HAL_RCC_GPIOB_CLK_ENABLE();
  GPIO_InitStructure.Mode = GPIO_MODE_IT_RISING_FALLING;
  GPIO_InitStructure.Pull = GPIO_NOPULL;
   GPIO_InitStructure.Speed =GPIO_SPEED_HIGH;
  GPIO_InitStructure.Pin = GPIO_PIN_2;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStructure);
    HAL_NVIC_SetPriority(EXTI0_IRQn, 2, 0);
  HAL_NVIC_EnableIRQ(EXTI0_IRQn);
  */
  
   GPIO_InitTypeDef   GPIO_InitStructure;
  __HAL_RCC_GPIOA_CLK_ENABLE(); 
  
  GPIO_InitStructure.Mode = GPIO_MODE_IT_RISING_FALLING;
  //GPIO_InitStructure.Pull = GPIO_NOPULL;
  GPIO_InitStructure.Pull = GPIO_PULLUP;
  //GPIO_InitStructure.Pull = GPIO_PULLDOWN;
  GPIO_InitStructure.Pin = GPIO_PIN_12;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStructure);

  HAL_NVIC_SetPriority(EXTI15_10_IRQn, 2, 0);
  HAL_NVIC_EnableIRQ(EXTI15_10_IRQn);
  
}
void Camera_Init(void){
   GPIO_InitTypeDef   GPIO_InitStructure;

  __HAL_RCC_GPIOC_CLK_ENABLE();
  
  GPIO_InitStructure.Mode = GPIO_MODE_INPUT;
  GPIO_InitStructure.Pull = GPIO_NOPULL;
   GPIO_InitStructure.Speed =GPIO_SPEED_HIGH;
  GPIO_InitStructure.Pin = GPIO_PIN_0|GPIO_PIN_1|GPIO_PIN_2|GPIO_PIN_3|GPIO_PIN_4|GPIO_PIN_5|GPIO_PIN_6|GPIO_PIN_7;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStructure);
}

//**************************************************************************
//   Kalman滤波
//**************************************************************************
extern float g_fCarAngle;
extern float g_fGyroscopeAngleSpeed;
float angle, angle_dot;         //外部需要引用的变量
static float q_bias;
float R_angle;
//-------------------------------------------------------
void Kalman_Filter(float angle_m,float gyro_m)	          //gyro_m:gyro_measure
{

  	 //-------------------------------------------------------
	//float Q_angle=0.001, Q_gyro=0.003,  dt=0.005; //R_angle越大跟踪速度越快
				                      //注意：dt的取值为kalman滤波器采样时间;
        float dt=0.005;  //0.005
       
        float Q_angle=0.001, Q_gyro=0.003; 
        float R_angle=160;
        
	float P[2][2] = {	{ 1, 0 },
				{ 0, 1 }
				};
		
	float Pdot[4] ={0,0,0,0};
	
	const char C_0 = 1;
	
