flyloong/BLE_Blance_Car/Projects/STM32F411RE-Nucleo/Examples/TIM/TIM_PWMInput/Src/my_fun.h
	float  angle_err, PCt_0, PCt_1, E, K_0, K_1, t_0, t_1;
	//-------------------------------------------------------


	g_fCarAngle+=(gyro_m-q_bias) * dt;//先验估计
	
	Pdot[0]=Q_angle - P[0][1] - P[1][0];// Pk-' 先验估计误差协方差的微分
	Pdot[1]=- P[1][1];
	Pdot[2]=- P[1][1];
	Pdot[3]=Q_gyro;
	
	P[0][0] += Pdot[0] * dt;// Pk- 先验估计误差协方差微分的积分 = 先验估计误差协方差
	P[0][1] += Pdot[1] * dt;
	P[1][0] += Pdot[2] * dt;
	P[1][1] += Pdot[3] * dt;
	
	
	angle_err = angle_m - g_fCarAngle;//zk-先验估计
	
	
	PCt_0 = C_0 * P[0][0];
	PCt_1 = C_0 * P[1][0];
	
	E = R_angle + C_0 * PCt_0;
	
	K_0 = PCt_0 / E;//Kk
	K_1 = PCt_1 / E;
	
	t_0 = PCt_0;
	t_1 = C_0 * P[0][1];

	P[0][0] -= K_0 * t_0;//后验估计误差协方差
	P[0][1] -= K_0 * t_1;
	P[1][0] -= K_1 * t_0;
	P[1][1] -= K_1 * t_1;
	
	
	g_fCarAngle+= K_0 * angle_err;//后验估计
	q_bias	+= K_1 * angle_err;//后验估计
	g_fGyroscopeAngleSpeed = gyro_m-q_bias;//输出值（后验估计）的微分 = 角速度
  

}
void Float2Char(float Value, char *array) 
{
int IntegerPart;
float DecimalPart;
int i = 0;
int j = 0;
char temp;
//分离整数部分与小数部分：
//整数部分保存在IntegerPart中
//小数部分保存在DecimalPart中
if (Value>=1)
{
IntegerPart = (int)Value;
DecimalPart = Value-IntegerPart;
}
else
{
IntegerPart=0;
DecimalPart=Value-IntegerPart;
}
//转换整数部分
if(IntegerPart==0)
{
array[0]=0+48;
array[1]='.';
i=1;
}
else
{
while(IntegerPart>0)
{
array[i]=IntegerPart%10+48;
IntegerPart=IntegerPart/10;
i++;
}
i--;
//修正转换结果的顺序
for(j=0;j+1<=(i+1)/2;j++)
{
temp=array[j];
array[j]=array[i-j];
array[i-j]=temp;
}
i++;
array[i]='.';
}
//转换小数部分，此处设置最多转换到第四位小数
i++;
array[i++] = (int)(DecimalPart*10)%10+48;
//array[i++] = (int)(DecimalPart*100)%10+48;
//array[i++] = (int)(DecimalPart*1000)%10+48;
//array[i++] = (int)(DecimalPart*10000)%10+48;
array[i] = '\0'; //结束符
} 



#endif 